![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 2

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta **datasets**.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/US_Crime_Rates_1960_2014.csv***.

Este dataset contém dados de crimes ocorridos nos Estados Unidos no período de 1960 até 2014.

Salve os dados em uma variável de nome *crime*.

In [137]:
import pandas as pd
crime = pd.read_csv('US_Crime_Rates_1960_2014.csv')

### Tarefa 2. Qual o tipo de dados em cada coluna?

In [138]:
crime.dtypes

Year                  int64
Population            int64
Total                 int64
Violent               int64
Property              int64
Murder                int64
Forcible_Rape         int64
Robbery               int64
Aggravated_assault    int64
Burglary              int64
Larceny_Theft         int64
Vehicle_Theft         int64
dtype: object

In [139]:
crime.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

### Tarefa 3. Converta o tipo de dado da coluna Year para o tipo datetime

*Dica: procure na documentação da biblioteca como fazer tal conversão*

In [140]:
crime['Year'] = pd.to_datetime(crime['Year'], format='%Y')

In [141]:
crime.dtypes

Year                  datetime64[ns]
Population                     int64
Total                          int64
Violent                        int64
Property                       int64
Murder                         int64
Forcible_Rape                  int64
Robbery                        int64
Aggravated_assault             int64
Burglary                       int64
Larceny_Theft                  int64
Vehicle_Theft                  int64
dtype: object

In [142]:
crime.tail()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
50,2010-01-01,309330219,10363873,1251248,9112625,14772,85593,369089,781844,2168457,6204601,739565
51,2011-01-01,311587816,10258774,1206031,9052743,14661,84175,354772,752423,2185140,6151095,716508
52,2012-01-01,313873685,10219059,1217067,9001992,14866,85141,355051,762009,2109932,6168874,723186
53,2013-01-01,316497531,9850445,1199684,8650761,14319,82109,345095,726575,1931835,6018632,700294
54,2014-01-01,318857056,9475816,1197987,8277829,14249,84041,325802,741291,1729806,5858496,689527

### Tarefa 4. Configure a coluna Year como index do DataFrame.

*Dica: use a função set_index() do Pandas*

In [143]:
#primeiro, extrai-se somente o ano do tipo DateTime 'Year'. Nesta extração, 'Year' se torna do tipo int64 de novo.
crime['Year'] = crime['Year'].dt.year  
crime.set_index('Year',inplace=True)

In [144]:
crime.head()

,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,,
1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

### Tarefa 5. Remova a coluna Total do DataFrame.

In [145]:
crime.drop('Total', axis=1, inplace=True)

In [146]:
crime.head()

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960,179323175,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961,182992000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962,185771000,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963,188483000,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964,191141000,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

### Tarefa 6. Encontre o número de roubos de carro do ano de 1978.

In [149]:
crime.loc[1978, 'Vehicle_Theft']

1004100

### Tarefa 7. Retorne a linha do ano em que houve o maior número de assasinatos. 

*Dica: use a coluna Murder como referência.*

In [161]:
crime[crime['Murder'] == crime['Murder'].max()]

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1991,252177000,1911770,12961100,24700,106590,687730,1092740,3157200,8142200,1661700

In [166]:
crime['Murder'].sort_values(ascending=False)

Year
1991    24700
1993    24530
1992    23760
1990    23440
1994    23330
1980    23040
1981    22520
1995    21610
1989    21500
1979    21460
1982    21010
1974    20710
1988    20680
1986    20613
1975    20510
1987    20096
1996    19650
1973    19640
1978    19560
1983    19310
1977    19120
1985    18980
1976    18780
1984    18690
1972    18670
1997    18208
1971    17780
2006    17030
2007    16929
1998    16914
2005    16740
2003    16528
2008    16442
2002    16229
2004    16148
2001    16037
1970    16000
2000    15586
1999    15522
2009    15399
2012    14866
2010    14772
1969    14760
2011    14661
2013    14319
2014    14249
1968    13800
1967    12240
1966    11040
1965     9960
1964     9360
1960     9110
1961     8740
1963     8640
1962     8530
Name: Murder, dtype: int64

### Tarefa 8. Retorne o número de assassinatos do ano em que foi registrado o menor número de roubo de carros.

In [171]:
crime[crime['Vehicle_Theft'] == crime['Vehicle_Theft'].min()]['Murder']

Year
1960    9110
Name: Murder, dtype: int64

In [174]:
crime['Vehicle_Theft'].sort_values()

Year
1960     328200
1961     336000
1962     366800
1963     408300
1964     472800
1965     496900
1966     561200
1967     659800
2014     689527
2013     700294
2011     716508
2012     723186
2010     739565
1968     783600
2009     795652
1969     878500
1972     887200
1970     928400
1973     928800
1971     948200
2008     958629
1976     966000
1974     977100
1977     977700
1978    1004100
1983    1007900
1975    1009600
1984    1032200
1982    1062400
1981    1087800
2007    1095769
1985    1102900
1979    1112800
1980    1131700
1999    1152075
2000    1160002
2006    1192809
1986    1224137
2001    1228391
2005    1235859
2004    1237851
1998    1240754
2002    1246646
2003    1261226
1987    1288674
1997    1354189
1996    1394200
1988    1432900
1995    1472400
1994    1539300
1993    1563100
1989    1564800
1992    1610800
1990    1635900
1991    1661700
Name: Vehicle_Theft, dtype: int64

**Parabéns! Você chegou ao fim**